# Parameter Type Id Rebar Shape Crank Start Length Property

Source: https://www.revitapidocs.com/2026/92d37b23-b86a-0c04-85aa-93662e80dea2.htm

---

| Parameter Type Id Rebar Shape Crank Start Length Property |
| --- |

"Start Crank Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankStartLength { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankStartLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankStartLength {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankStartLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace